intermediatePlus/pimpleFoam_LES_dynamickEqn/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-5;
// inlet turbulent KE (k) for BC (LES)  can be 0.2 times of inlet k for RANS
boundaryField
{
    topPatch
    {
        type            fixedValue;
        value           $internalField;

    }
    wall
    {
        type            fixedValue;
        value           uniform 0;
    }

    bottomPatch
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
